<a href="https://colab.research.google.com/github/jiyoumin/Python/blob/master/csv_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
import glob

In [90]:
path = '/content/sample_data/'
for file_name in glob.glob(path+'*.csv') :
  print(file_name)

/content/sample_data/mnist_test.csv
/content/sample_data/california_housing_train.csv
/content/sample_data/mnist_train_small.csv
/content/sample_data/california_housing_test.csv

In [0]:
files = '/content/drive/My Drive/1/data/score_data/'
files_list = glob.glob(files+'*.csv')

In [95]:
files_list

['/content/drive/My Drive/1/data/score_data/A 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/B 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/C 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/E 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/F 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/D 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/I 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/J 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/G 학교출신 지원자.csv',
 '/content/drive/My Drive/1/data/score_data/H 학교출신 지원자.csv']

In [0]:
A_data='/content/drive/My Drive/1/data/score_data/A 학교출신 지원자.csv'

In [97]:
df=pd.read_csv(A_data, encoding='cp949')
df.head()

  출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
0    A  30104  조매미  70  66  78   38   42
1    A  30115  김개미  71  77  89   15   20
2    A  30117  박모기  76  55  75   35   30
3    A  30120  최파리  69  66  51   15   36
4    A  30215  정땅벌  63  20  76   15   19

## **map과 list**

```
# 코드로 형식 지정됨
```

In [98]:
a=input('숫자입력>>> ').split()

숫자입력>>> 12  3 4

In [99]:
type(a)

list

In [17]:
list_a=list(a)
list_a, type(list_a)

(['1', '5', '3', '4'], list)

In [0]:
list_num=list(map(int, list_a))

In [21]:
list_num

[1, 5, 3, 4]

In [100]:
a=[]
a

[]

In [101]:
a.append(10)
a

[10]

In [0]:
stu=[]
for file in files_list:
  data=pd.read_csv(file, encoding='cp949')
  stu.append(data)

In [0]:
stu

## **concat**

```
# concat
```

In [0]:
a=[['a','b','c'],[10,20,30]]
b=[['d','e','f','add'],[-3,5,7,100]]

In [105]:
print(a)
print(b)

[['a', 'b', 'c'], [10, 20, 30]]
[['d', 'e', 'f', 'add'], [-3, 5, 7, 100]]

In [106]:
af=pd.DataFrame(a)
af

    0   1   2
0   a   b   c
1  10  20  30

In [107]:
bf=pd.DataFrame(b)
bf

    0  1  2    3
0   d  e  f  add
1  -3  5  7  100

In [0]:
af.columns=['A','B','C']
bf.columns=['A','B','C','D']

In [111]:
af

    A   B   C
0   a   b   c
1  10  20  30

In [112]:
bf

    A  B  C    D
0   d  e  f  add
1  -3  5  7  100

In [0]:
hap=pd.concat([af,bf])

In [0]:
hap.index=[1,2,3,4]

In [115]:
hap

    A   B   C    D
1   a   b   c  NaN
2  10  20  30  NaN
3   d   e   f  add
4  -3   5   7  100

In [0]:
df=pd.concat(stu)
df.tail

In [0]:
df.index=range(1,310)

In [122]:
df.tail()

    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
305    H  30828   수애  87  55  55   50   50
306    H  30829  유지인  74  53  59   26   40
307    H  30731  윤정희  85  83  86   41   41
308    H  30732  이민정  58  32  67   14   12
309    H  30733  이영자  79  62  98   27   15

In [124]:
df[47:57]

   출신고교     학번   이름  국어  수학  영어  과탐1  과탐2
48    B  30518  강제비  64  59  86   21   19
49    B  30606  조멧새  84  55  86   22   29
50    B  30611  윤원앙  84  70  54   38   30
51    B  30619  장잉꼬  91  69  76   34   37
52    B  30627  임솔개  37   9  10   20   15
53    B  30704  심황태  79  77  91   39   47
54    B  30710  노도미  77  17  47   41   39
55    B  30714  정농어  59  76  61   26   23
56    C  30110  강동원  69  40  68   34   19
57    C  30115  강문영  59  70  73   23   29

In [125]:
df['변환점수'] = df['국어']*0.2+df['수학']*0.4+(df['과탐1']+df['과탐2'])*0.4
df

    출신고교     학번   이름  국어  수학  영어  과탐1  과탐2  변환점수
1      A  30104  조매미  70  66  78   38   42  72.4
2      A  30115  김개미  71  77  89   15   20  59.0
3      A  30117  박모기  76  55  75   35   30  63.2
4      A  30120  최파리  69  66  51   15   36  60.6
5      A  30215  정땅벌  63  20  76   15   19  34.2
..   ...    ...  ...  ..  ..  ..  ...  ...   ...
305    H  30828   수애  87  55  55   50   50  79.4
306    H  30829  유지인  74  53  59   26   40  62.4
307    H  30731  윤정희  85  83  86   41   41  83.0
308    H  30732  이민정  58  32  67   14   12  34.8
309    H  30733  이영자  79  62  98   27   15  57.4

[309 rows x 9 columns]

In [0]:
df['합격']=df['변환점수']>70

In [127]:
df['합격']

1       True
2      False
3      False
4      False
5      False
       ...
305     True
306    False
307     True
308    False
309    False
Name: 합격, Length: 309, dtype: bool

In [128]:
df.sort_values('변환점수', ascending=False).head(10)

    출신고교     학번   이름   국어  수학  영어  과탐1  과탐2  변환점수    합격
285    H  30808  신동엽   87  92  89   50   49  93.8  True
267    G  30722  하지원   98  94  91   45   45  93.2  True
209    I  30812  김거북   80  93  90   49   50  92.8  True
44     B  30419  정타조  100  85  85   46   46  90.8  True
82     C  30805  지상렬   92  96  69   47   38  90.8  True
134    F  30406  김병만   84  96  79   42   45  90.0  True
164    D  30420  장미희   97  88  86   44   44  89.8  True
234    J  30720  이승우   98  88  89   37   50  89.6  True
215    J  30116  전이경   96  88  78   38   49  89.2  True
218    J  30227  조윤정   88  88  80   44   47  89.2  True